# usr/bin/ruby
# coding:utf-8

=begin rdoc
=DreamSelect
==Rocinanteの思考プログラム
  夢の選択をします。
=end

module Rocinante
  # Brainクラス
  class DreamSelect
    def initialize
      ##################################################################
      # FIXME ろしなんてのタスクを選択する際に使用される脳プログラムの一部です。
      #       タスク選択は現在直近の仕事がある場合それを行う。
      #       順位...
      #       1.優先度緊急のもの
      #       2.開始時間に達している仕事
      #       3.趣味、遊び
      #       1,2は依頼により生じるタスク。3は自ら考えるタスク
      ##################################################################
    end
  end
end
